cla
hold on
leg = {};

a__= [  12 0.7172150000	0.4821190000	0.1007850000	-0.0572617000	-0.0434293000	-0.0025706500	0.0076218200	0.0016123000	0.0009144900	0.0001070570	-0.0004118280	0.0000812236
        12 0.0000000000	-0.6879050000	0.0528450000	0.1928270000	-0.0239495000	0.0337432000	-0.0031931300	-0.0082939700	0.0008158960	-0.0000712195	0.0002739660	-0.0000540336
        12 0.6853030000	-0.4999470000	0.1461390000	0.0322635000	-0.0249847000	0.0092418300	-0.0046033700	-0.0002193460	-0.0006710620	-0.0000620485	0.0002386880	-0.0000470757];
b__=[   7 0.6636790000	0.4996830000	0.1553180000	-0.0494516000	-0.0573942000	-0.0081058900	0.0123629000
        7 0.0000000000	0.6880630000	0.0473184000	-0.1537010000	-0.0260899000	-0.0047508900	0.0015184900
        7 0.6624620000	-0.5099850000	0.0954987000	0.0783513000	-0.0690810000	-0.0085326700	0.0195878000];
N=3;
sym_coef = [1 -1 1];
dir_filter=[a__(:,end:-1:3).*sym_coef.', a__(:,2:end)];
inv_filter=[b__(:,end:-1:3).*sym_coef.', b__(:,2:end)];
inv_norm = sqrt(sum(inv_filter.^2,2));
dir_filter=dir_filter.*inv_norm;
inv_filter=inv_filter./inv_norm;
delta = 368.332995/128; %the response of LL to shift

im_name = 'files/no filter/kiel/fileSub_Y_0_orig.txt';
original=importdata(im_name);
dwt_ca_1=dwt(original, dir_filter, 0);
dwt_g = dwt_ca_1{1}(:);

for qf=[0.02 0.01 0.005 1/300]
    sh = 164*delta;
    dwt_q = quant_r(dwt_g-sh,qf);
    dwt_d = dequant_r(dwt_q,qf)+sh;
    dwt_e = (dwt_g-dwt_d)*qf;
    ksdensity(dwt_e)
    leg{end+1}=num2str(1/qf);
end
axis auto
xlim([-0.5 0.5])
yl=ylim;
ylim([0 yl(2)])
legend(leg);
title(legend,'Шаг квантования')
xlabel('Ошибка')